package d0305;

import java.util.Arrays;
import java.util.Scanner;

/*
 * 최소개의 버튼을 눌러서 원하는 값으로 갈 수 있는지를 출력
 * 
 * 주어진 버튼으로 만들 수 있는 수를 원하는 수의 자릿까지 만든 후 나누어 떨어지지 않으면 
 * 
 * 기준을 잘못 잡았다. 완탐은 맞는데 target의 약수중에서 버튼으로 만들 수 있는 수로 나누어야 했는데
 * 나는 버튼으로 만든 수중에서 약수인 수를 고르려고 했다.
 * 
 * 후자인 방향은 너무 많은 수를 확인해 봐야 하지만
 * 전자는 매번 그 수의 약수(제곱근)정도만 확인하면 되므로 계산 양이 적어진다.
 * 
 * 하아.....더하자!
 * */
public class SWEA_1808_D4_지희의고장난계산기 {
	public static boolean[] buttons = new boolean[10];
	public static int result = 0;

	public static void main(String[] args) {
		Scanner sc = new Scanner(System.in);
		sc = new Scanner(src);
		StringBuilder sb = new StringBuilder();

		int T = sc.nextInt();
		for(int t= 1; t <= T; t++) {
			sb.append("#").append(t).append(" ");
			Arrays.fill(buttons,  false);
			result = Integer.MAX_VALUE;
			for(int i =0 ; i < 10; i++) {
				if(sc.nextInt() == 1) {
					buttons[i] = true;
				}
			}
			int target = sc.nextInt();
			
			result = dfs(target);
			
			result = (result == Integer.MAX_VALUE) ? -1 : result;
			sb.append(result).append("\n");
		}
		System.out.println(sb);
	}

	public static int dfs(int target) {
		int tmp = Integer.MAX_VALUE;
		int len = check(target);
		
		if(len != 0) {
			return len + 1;
		}else {
			for(int i = 2; i*i < target; i++) {
				int tmplen = check(i);
				if(target % i == 0 && tmplen != 0) {
					int tt = dfs(target/i);
					if(tt > -1){
						tmp = (tmp < tt + tmplen + 1)? tmp : tt+tmplen+1;
					}
				}
			}
		}
		
		if(tmp == Integer.MAX_VALUE)
			tmp = -1;
		return tmp;
	}

	public static int check(int target) {
		if(target == 0) {
			return (buttons[target])? 1 : 0;
		}
		int dv = 10;
		int len = 0;
		while(target >0) {
			if(!buttons[target%10]) {
				return 0;
			}
			len++;
			target /= 10;
		}
		return len;		
	}
	private static String src = "100\r\n" + 
			"0 0 0 1 1 0 1 0 0 1\r\n" + 
			"34396\r\n" + 
			"1 1 0 0 0 0 0 1 1 0\r\n" + 
			"1000000\r\n" + 
			"0 0 0 0 1 0 0 0 1 1\r\n" + 
			"844898\r\n" + 
			"1 1 0 1 0 0 1 0 1 0\r\n" + 
			"68008\r\n" + 
			"0 0 0 0 0 0 0 0 0 1\r\n" + 
			"793881\r\n" + 
			"1 0 1 1 0 1 1 0 1 1\r\n" + 
			"396335\r\n" + 
			"1 1 0 0 0 1 1 0 0 1\r\n" + 
			"658395\r\n" + 
			"0 0 0 0 0 1 0 0 0 0\r\n" + 
			"34375\r\n" + 
			"0 0 0 0 0 0 1 0 0 0\r\n" + 
			"23976\r\n" + 
			"1 0 0 0 1 0 1 0 1 1\r\n" + 
			"844\r\n" + 
			"0 0 0 0 0 0 1 0 0 0\r\n" + 
			"666\r\n" + 
			"1 1 0 0 0 1 0 1 0 0\r\n" + 
			"180945\r\n" + 
			"0 0 0 0 1 1 0 1 1 1\r\n" + 
			"57475\r\n" + 
			"0 1 0 0 0 0 0 0 0 0\r\n" + 
			"123321\r\n" + 
			"0 0 0 0 1 0 1 0 1 0\r\n" + 
			"6\r\n" + 
			"0 1 0 0 0 0 0 0 0 0\r\n" + 
			"1111\r\n" + 
			"1 0 0 1 0 1 1 0 1 1\r\n" + 
			"47206\r\n" + 
			"1 1 1 1 1 0 0 0 0 1\r\n" + 
			"920\r\n" + 
			"1 0 0 0 0 1 0 0 0 0\r\n" + 
			"5500\r\n" + 
			"0 0 0 1 0 1 0 0 0 0\r\n" + 
			"83025\r\n" + 
			"1 0 0 0 0 0 0 1 1 0\r\n" + 
			"60900\r\n" + 
			"1 0 0 0 1 0 0 1 0 1\r\n" + 
			"7\r\n" + 
			"0 1 0 0 0 0 0 0 0 0\r\n" + 
			"13431\r\n" + 
			"0 0 0 0 1 0 0 0 0 0\r\n" + 
			"78144\r\n" + 
			"0 0 1 0 0 0 1 0 0 0\r\n" + 
			"2222\r\n" + 
			"1 0 0 0 0 1 1 0 1 0\r\n" + 
			"86506\r\n" + 
			"0 1 0 0 0 0 1 0 1 0\r\n" + 
			"86811\r\n" + 
			"0 0 0 1 0 0 0 0 0 0\r\n" + 
			"890109\r\n" + 
			"1 0 1 0 1 0 1 0 1 0\r\n" + 
			"20\r\n" + 
			"1 1 1 0 0 1 0 0 0 1\r\n" + 
			"285499\r\n" + 
			"1 0 0 0 0 1 0 0 0 0\r\n" + 
			"5555\r\n" + 
			"0 0 0 0 0 0 1 0 0 0\r\n" + 
			"396\r\n" + 
			"1 1 1 1 0 0 0 0 0 0\r\n" + 
			"310\r\n" + 
			"1 1 0 0 0 1 0 0 0 0\r\n" + 
			"15110\r\n" + 
			"0 0 0 0 0 0 1 0 1 0\r\n" + 
			"4128\r\n" + 
			"0 1 0 1 0 0 0 0 0 1\r\n" + 
			"9\r\n" + 
			"0 0 0 0 1 1 1 0 1 0\r\n" + 
			"8\r\n" + 
			"0 1 0 0 0 0 0 0 0 0\r\n" + 
			"12221\r\n" + 
			"0 0 0 0 0 0 0 0 1 0\r\n" + 
			"782144\r\n" + 
			"0 0 0 1 0 1 1 0 0 1\r\n" + 
			"994661\r\n" + 
			"0 1 0 0 0 1 1 0 0 0\r\n" + 
			"1666\r\n" + 
			"0 0 1 0 0 0 0 0 0 0\r\n" + 
			"8888\r\n" + 
			"0 0 0 1 0 0 0 0 0 0\r\n" + 
			"10989\r\n" + 
			"1 0 0 1 1 1 0 0 0 0\r\n" + 
			"5\r\n" + 
			"0 0 0 1 1 0 0 0 0 0\r\n" + 
			"443433\r\n" + 
			"0 1 0 1 0 1 0 0 0 0\r\n" + 
			"45\r\n" + 
			"0 0 1 0 0 1 1 1 0 0\r\n" + 
			"772527\r\n" + 
			"0 0 0 1 0 0 1 1 0 0\r\n" + 
			"587972\r\n" + 
			"0 0 1 0 0 1 0 1 0 0\r\n" + 
			"2772\r\n" + 
			"0 0 0 1 0 0 0 1 0 0\r\n" + 
			"7777\r\n" + 
			"0 1 1 0 0 1 1 1 1 0\r\n" + 
			"225575\r\n" + 
			"1 0 1 1 1 1 1 1 0 0\r\n" + 
			"326066\r\n" + 
			"0 1 0 0 1 1 0 0 0 0\r\n" + 
			"55141\r\n" + 
			"1 1 0 0 0 0 1 1 0 0\r\n" + 
			"1\r\n" + 
			"0 0 1 0 1 0 1 1 0 0\r\n" + 
			"666242\r\n" + 
			"0 0 0 1 1 1 1 0 0 0\r\n" + 
			"66633\r\n" + 
			"1 1 1 1 0 0 1 1 0 0\r\n" + 
			"2132\r\n" + 
			"0 1 0 0 0 0 1 1 1 0\r\n" + 
			"881166\r\n" + 
			"0 0 0 0 1 0 0 0 0 0\r\n" + 
			"19536\r\n" + 
			"0 1 0 1 1 0 0 1 0 0\r\n" + 
			"17743\r\n" + 
			"1 1 0 1 0 0 0 0 0 0\r\n" + 
			"980003\r\n" + 
			"1 1 0 1 1 1 1 1 0 1\r\n" + 
			"474936\r\n" + 
			"1 0 1 1 0 1 0 0 1 1\r\n" + 
			"802800\r\n" + 
			"0 0 0 0 0 0 0 0 0 1\r\n" + 
			"89991\r\n" + 
			"1 0 1 1 0 0 1 0 0 0\r\n" + 
			"20222\r\n" + 
			"0 0 0 0 0 0 1 0 0 0\r\n" + 
			"85536\r\n" + 
			"0 0 0 1 0 0 0 0 0 1\r\n" + 
			"9333\r\n" + 
			"0 0 0 0 0 1 0 0 0 0\r\n" + 
			"378125\r\n" + 
			"1 0 1 0 0 0 0 0 0 0\r\n" + 
			"440040\r\n" + 
			"0 1 1 1 1 0 0 0 1 0\r\n" + 
			"11131\r\n" + 
			"1 0 0 1 1 1 1 0 0 1\r\n" + 
			"6990\r\n" + 
			"1 1 0 1 1 0 1 1 1 1\r\n" + 
			"876496\r\n" + 
			"0 1 0 0 0 0 0 0 0 1\r\n" + 
			"17991\r\n" + 
			"0 0 0 1 0 0 0 0 1 0\r\n" + 
			"8838\r\n" + 
			"0 1 1 1 0 1 1 0 0 0\r\n" + 
			"100914\r\n" + 
			"0 0 1 0 0 0 0 0 1 1\r\n" + 
			"929822\r\n" + 
			"0 1 0 0 0 0 0 0 1 0\r\n" + 
			"1584\r\n" + 
			"1 1 1 0 0 0 1 0 0 0\r\n" + 
			"2\r\n" + 
			"0 1 0 0 0 0 0 1 0 0\r\n" + 
			"7117\r\n" + 
			"0 0 1 0 1 0 0 0 1 0\r\n" + 
			"44448\r\n" + 
			"0 0 1 1 0 1 0 1 0 1\r\n" + 
			"285846\r\n" + 
			"0 1 0 1 0 0 0 1 0 1\r\n" + 
			"229632\r\n" + 
			"0 0 1 1 1 0 0 0 1 1\r\n" + 
			"114004\r\n" + 
			"1 0 0 1 1 0 0 0 0 0\r\n" + 
			"3\r\n" + 
			"0 0 0 0 1 1 0 0 0 0\r\n" + 
			"45444\r\n" + 
			"0 0 0 1 0 0 0 0 0 0\r\n" + 
			"98901\r\n" + 
			"1 0 0 1 0 0 1 0 0 1\r\n" + 
			"89239\r\n" + 
			"0 1 0 0 1 1 1 1 1 1\r\n" + 
			"468617\r\n" + 
			"0 1 0 0 0 0 0 0 0 1\r\n" + 
			"199191\r\n" + 
			"1 0 0 1 0 0 1 0 0 0\r\n" + 
			"654480\r\n" + 
			"0 0 1 0 0 0 1 0 0 0\r\n" + 
			"222666\r\n" + 
			"0 0 0 0 0 1 0 1 0 0\r\n" + 
			"290625\r\n" + 
			"1 1 0 0 1 0 0 0 0 0\r\n" + 
			"4\r\n" + 
			"0 0 1 0 1 1 0 1 1 0\r\n" + 
			"245282\r\n" + 
			"0 0 0 0 1 0 0 0 0 0\r\n" + 
			"78144\r\n" + 
			"0 0 0 0 0 0 0 0 0 1\r\n" + 
			"891\r\n" + 
			"1 0 0 0 1 0 1 0 1 1\r\n" + 
			"968469\r\n" + 
			"1 1 1 1 1 0 1 1 1 1\r\n" + 
			"11763\r\n" + 
			"0 1 0 0 0 1 0 1 0 1\r\n" + 
			"55959\r\n" + 
			"1 0 0 1 0 0 1 0 0 0\r\n" + 
			"606\r\n" + 
			"";
}
